import 'package:flutter/material.dart';
class MainUnionMessage extends StatefulWidget {
  @override
  _MainUnionMessageState createState() => _MainUnionMessageState();
}

class _MainUnionMessageState extends State<MainUnionMessage> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('Students Union Message',style: TextStyle(color: Colors.black),),
        centerTitle: true,
        elevation: 1.0,
      ),
      body:SingleChildScrollView(
        child:  Column(
          children: [
            SizedBox(height: 15.0,),
            Container(
              child: Text('මහා ශිෂ්‍ය සංගමයේ පණිවිඩය',style: TextStyle(color: Colors.black,fontWeight: FontWeight.bold , fontSize: 21.0),),
            ),
            SizedBox(height: 10.0,),
            Container(
              child: Padding(
                  padding: EdgeInsets.only(left: 15.0 ,right: 15.0),
                  child: Text("දහතුන් වසරක පාසල් අධ්‍යාපනය නිමා කර, උසස් අධ්‍යාපන කටයුතු සිදු කිරීම සඳහා ශ්‍රී ලංකා සබරගමුව විශ්වවිද්‍යාලයට පිවිසන ඔබ සැම සබරගමුව විශ්වවිද්‍යාලයීය මහා ශිෂ්‍ය සංගමය ලෙස සාදරයෙන් පිළිගනිමු.\n\n"
                      "දැඩි තරගකාරී අධ්‍යාපන රටාවක් තුල, විශාල කැපකිරීම් ප්‍රමාණයක් කර විශ්වවිද්‍යාලයට ඇතුලත් වන ඔබ, ඔබගේ අනාගතය සාර්ථක ලෙස නිර්මාණය කරගැනීමේ අරමුණක ඇති. ඔබ සමඟ සිටි යහළුවන් එලෙස එම සිහිනය දකින්නට ඇති. නමුත් නිදහස් අධ්‍යාපනයේ අධ්‍යාපන අවස්ථා සීමිත වීම නිසා විශ්වවිද්‍යාලවලට ඇතුලත් වන්නේ සීමිත සිසුන් ප්‍රමාණයකි, ඒ ලෙස ඇතුලත් වන ඔබ හැදි වැඩි පෝෂණය වන්නේ ආත්මාර්ථය පිරිණු සමාජයකයි. එය ඔබගේ වැරැද්දක් නොව මේ සමාජයේ මිනිසුන් නිර්මාණය කරන ආකාරයේ ගැටළුවකි.\n\n"
                      "එසේනම් ඔබට ගැටළුවක් නිසැකයෙන් පවතී, මේ සමාජය පරාර්ථකාමී සමාජයක් ලෙසට නිර්මාණය කරන්නේ කෙසේද යන්න, විශ්වවිද්‍යාලයට පැමිණි ඔබට මේ සමාජය දෙස බලන ආකාරයේ වෙනසක් ඔබට ඇතිවේවි, අනෙකාගේ අයිතීන් වෙනුවන් සටන් කිරීමේ පෞර්ෂයක් නිර්මාණය වෙවී. එම නිසාම මෙම සමාජය පරාර්ථකාමී කිරීමේ අභියෝගය වගකීමකි. අධ්‍යාපනය යන මානව අයිතිය මේ මුළු සමාජයටම කිමිකරදීම අපසතු වගකීමකි. කලාව, ක්‍රීඩාව, දේශපාලනය, අධ්‍යාපනය යන ආදී දෑ වලින් පරිපූර්ණ වූ පුද්ගලයෙකු බවට පත්වීම විශ්වවිද්‍යාල විද්‍යාර්ථයාගේ අරමුණ විය යුතුයි.\n\n"
                      "විශ්වවිද්‍යාල අධ්‍යාපනය තුල අධ්‍යාපන කටයුතු සිදු කරන්නේ ඉංග්‍රීසි මාධ්‍ය උපයෝගී කරගනිමිනි එම නිසාම භාෂා සම්බන්දයෙන් ගැටළු ඔබට පවතී. එම ගැටළු මගහැරීමේ අරමුණින් දෙවන වසර සහෝදරත්වය විසින් මෙම පොත් පිංච ඔබගේ අධ්‍යාපන කටයුතු සඳහා උපකාර"
                      " කරගැනීමට ඔබට ලබාදෙනු ඇත. ඉදිරි අධ්‍යාපන කටයුතු ජයගෙන මේ සමාජය යහපත් ලෙස නිර්මාණය කිරීමේ අරමුණට එක්වෙමු. ජයවේවා.\n\nධනුෂ්ක නුවන්\n"
                      "සභාපති\n"
                      "මහා  ශිෂ්‍ය සංගමය\n"
                      "ශ්‍රී ලංකා සබරගමුව විශ්වවිද්‍යාලය\n"
                      "071-5555784",style: TextStyle(color: Colors.black , fontSize: 16.0,fontWeight: FontWeight.w500 ),),
                  )
              ),

          ],
        )
      )
    );
  }
}
